app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "csassadi@miuandes.cl"], ["LIMIT", 1]]
---
	def create
		#complete this method
		#@user = User.find_by_email(params[:email].downcase)


		user = User.find_by(email: params[:session][:email].downcase)